// 还没有数据，先行设计数据格式  都是json格式

// 工程地点的数据格式
var pData = {
    // 。。。。一些响应状态参数等
    "data" : [
        // id用于点击气泡的时候发起请求
        {id:'1',longitude:'115.....',latitude:'11.26666'},
        {id:'2',longitude:'115.....',latitude:'11.26666'}
        // ...
    ],
}

// 电子围栏的数据格式
var dData = {
    // 。。。。一些响应状态参数等
    "data" : [{
        "id": "1",      //  工地id  或者啥的  
        "longitude": "113.303037",    //根据下面四个点算出来的
        "latitude": "22.76938",
        //  计算方法， 第一、三点的经纬度加起来除2
        "list": [{
            "longitude": "113.302037",
            "latitude": "22.77038"
        }, {
            "longitude": "113.304037",
            "latitude": "22.77038"
        }, {
            "longitude": "113.304037",
            "latitude": "22.76838"
        }, {
            "longitude": "113.302037",
            "latitude": "22.76838"
        }]
    }] 
}



// 车辆的数据格式
var cData = {
     // 。。。。一些响应状态参数等
     "data" : [
        // id用于点击气泡的时候发起请求
        {id:'1',longitude:'115.....',latitude:'11.26666'},
        {id:'2',longitude:'115.....',latitude:'11.26666'}
        // ...
    ],
}

